import re

BAD_WORDS = [
    "бля", "блядь", "сука", "сучара", 
    "хуй", "хуйовий", "хуйня", "хуєсос", "нахуй", "похуй",
    "пизда", "пиздець", "пиздити", "манда",
    "єбати", "єбало", "єблан", "довбойоб", "уйобок", "заїбав",
    "мудак", "мудило", 
    "підор", "підар", "підарас", "гандон",
    "шлюха", "курва", "хвойда", "шмара",
    "гівно", "лайно", "срака", "засранець",
    "чмо", "лох", "чмирь", "дебіл", "ідіот", "придурок"
]

def contains_bad_words(text: str) -> bool:
    text_lower = text.lower()

    for word in BAD_WORDS:
        if word in text_lower:
            return True
        
    return False